// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

// function square(a, b) {
//     console.log((a + b) * 2)
// }
// square(20, 30);

// - створити функцію яка обчислює та повертає площу кола з радіусом r

// const circle = (r) => Math.PI * Math.pow(r, 2)
// console.log(circle(5))

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

// const cylinder = (r, h) => Math.PI * Math.pow(r, 2) * h
// console.log(cylinder(5, 2))

// - створити функцію яка приймає масив та виводить кожен його елемент

// let usersName = ['vasya', 'petya', 'olya', 'nastya'];
// function showName(massive) {
//     for (const name of usersName) {
//         console.log(name)
//     }
// }
// showName(usersName)

// - створити функцію яка створює параграф з текстом. Текст задати через аргумент

// function P(text) {
//     document.write(`<p>${text}</p>`)
// }
// P('text but its paragraph')
// P('another text but its paragraph')
// P('smile another text but its paragraph :3')

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

function ulCreator(text) {
    document.write(`<ul>
        <li>${text}</li>
        <li>${text}</li>
        <li>${text}</li>
    </ul>`)
}
ulCreator('LOL')

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)



// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список



// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.



// - створити функцію яка повертає найменьше число з масиву



// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13